Output from `terraform plan`
```
        tags                      = {
            "Domain"         = "orders"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (12 unchanged attributes hidden)

      ~ logging_configuration {
          ~ include_execution_data = false -> true
          ~ level                  = "OFF" -> "ERROR"
          + log_destination        = (known after apply)
        }

      ~ tracing_configuration {
          ~ enabled = false -> true
        }

        # (1 unchanged block hidden)
    }

  # module.replay-pipeline["person"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be created
  + resource "aws_cloudwatch_log_group" "step-function-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-person-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "person"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-person-preproduction"
        }
      + tags_all          = {
          + "Domain"         = "person"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-person-preproduction"
        }
    }

  # module.replay-pipeline["person"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
        id                        = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-person-preproduction"
        name                      = "dpr-replay-pipeline-nomis-person-preproduction"
        tags                      = {
            "Domain"         = "person"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (12 unchanged attributes hidden)

      ~ logging_configuration {
          ~ include_execution_data = false -> true
          ~ level                  = "OFF" -> "ERROR"
          + log_destination        = (known after apply)
        }

      ~ tracing_configuration {
          ~ enabled = false -> true
        }

        # (1 unchanged block hidden)
    }

  # module.replay-pipeline["prisoner"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be created
  + resource "aws_cloudwatch_log_group" "step-function-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-prisoner-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "prisoner"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-prisoner-preproduction"
        }
      + tags_all          = {
          + "Domain"         = "prisoner"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-prisoner-preproduction"
        }
    }

  # module.replay-pipeline["prisoner"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
        id                        = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-prisoner-preproduction"
        name                      = "dpr-replay-pipeline-nomis-prisoner-preproduction"
        tags                      = {
            "Domain"         = "prisoner"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (12 unchanged attributes hidden)

      ~ logging_configuration {
          ~ include_execution_data = false -> true
          ~ level                  = "OFF" -> "ERROR"
          + log_destination        = (known after apply)
        }

      ~ tracing_configuration {
          ~ enabled = false -> true
        }

        # (1 unchanged block hidden)
    }

  # module.replay-pipeline["prisoner-address"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be created
  + resource "aws_cloudwatch_log_group" "step-function-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-prisoner-address-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "prisoner-address"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-prisoner-address-preproduction"
        }
      + tags_all          = {
          + "Domain"         = "prisoner-address"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-prisoner-address-preproduction"
        }
    }

  # module.replay-pipeline["prisoner-address"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
        id                        = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-prisoner-address-preproduction"
        name                      = "dpr-replay-pipeline-nomis-prisoner-address-preproduction"
        tags                      = {
            "Domain"         = "prisoner-address"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (12 unchanged attributes hidden)

      ~ logging_configuration {
          ~ include_execution_data = false -> true
          ~ level                  = "OFF" -> "ERROR"
          + log_destination        = (known after apply)
        }

      ~ tracing_configuration {
          ~ enabled = false -> true
        }

        # (1 unchanged block hidden)
    }

  # module.replay-pipeline["prisoner-ed"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be created
  + resource "aws_cloudwatch_log_group" "step-function-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-prisoner-ed-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "prisoner-ed"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-prisoner-ed-preproduction"
        }
      + tags_all          = {
          + "Domain"         = "prisoner-ed"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-prisoner-ed-preproduction"
        }
    }

  # module.replay-pipeline["prisoner-ed"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
        id                        = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-prisoner-ed-preproduction"
        name                      = "dpr-replay-pipeline-nomis-prisoner-ed-preproduction"
        tags                      = {
            "Domain"         = "prisoner-ed"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (12 unchanged attributes hidden)

      ~ logging_configuration {
          ~ include_execution_data = false -> true
          ~ level                  = "OFF" -> "ERROR"
          + log_destination        = (known after apply)
        }

      ~ tracing_configuration {
          ~ enabled = false -> true
        }

        # (1 unchanged block hidden)
    }

  # module.replay-pipeline["prisoner-health"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be created
  + resource "aws_cloudwatch_log_group" "step-function-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-prisoner-health-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "prisoner-health"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-prisoner-health-preproduction"
        }
      + tags_all          = {
          + "Domain"         = "prisoner-health"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-prisoner-health-preproduction"
        }
    }

  # module.replay-pipeline["prisoner-health"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
        id                        = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-prisoner-health-preproduction"
        name                      = "dpr-replay-pipeline-nomis-prisoner-health-preproduction"
        tags                      = {
            "Domain"         = "prisoner-health"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (12 unchanged attributes hidden)

      ~ logging_configuration {
          ~ include_execution_data = false -> true
          ~ level                  = "OFF" -> "ERROR"
          + log_destination        = (known after apply)
        }

      ~ tracing_configuration {
          ~ enabled = false -> true
        }

        # (1 unchanged block hidden)
    }

  # module.replay-pipeline["prisoner-profile"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be created
  + resource "aws_cloudwatch_log_group" "step-function-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-prisoner-profile-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "prisoner-profile"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-prisoner-profile-preproduction"
        }
      + tags_all          = {
          + "Domain"         = "prisoner-profile"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-prisoner-profile-preproduction"
        }
    }

  # module.replay-pipeline["prisoner-profile"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
        id                        = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-prisoner-profile-preproduction"
        name                      = "dpr-replay-pipeline-nomis-prisoner-profile-preproduction"
        tags                      = {
            "Domain"         = "prisoner-profile"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (12 unchanged attributes hidden)

      ~ logging_configuration {
          ~ include_execution_data = false -> true
          ~ level                  = "OFF" -> "ERROR"
          + log_destination        = (known after apply)
        }

      ~ tracing_configuration {
          ~ enabled = false -> true
        }

        # (1 unchanged block hidden)
    }

  # module.replay-pipeline["program-profiles"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be created
  + resource "aws_cloudwatch_log_group" "step-function-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-program-profiles-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "program-profiles"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-program-profiles-preproduction"
        }
      + tags_all          = {
          + "Domain"         = "program-profiles"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-program-profiles-preproduction"
        }
    }

  # module.replay-pipeline["program-profiles"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Replay Pipeline Step Function"
              + StartAt = "Deactivate Archive Trigger"
              + States  = {
                  + "Archive Remaining Raw Files"                          = {
                      + Next       = "Copy Archived Data to Raw Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "program-profiles"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.datastorage.retry.maxAttempts"     = "10"
                              + "--dpr.datastorage.retry.maxWaitMillis"   = "10000"
                              + "--dpr.datastorage.retry.minWaitMillis"   = "1000"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Check All Files Have Been Replayed"                   = {
                      + Next       = "Empty Raw Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.allowed.s3.file.regex"               = "\\d+-\\d+.parquet"
                              + "--dpr.orchestration.max.attempts"          = "8"
                              + "--dpr.orchestration.wait.interval.seconds" = "900"
                            }
                          + JobName   = "pending-files-check-program-profiles-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Check All Pending Files Have Been Processed"          = {
                      + Next       = "Stop Glue Streaming Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.orchestration.max.attempts"          = "8"
                              + "--dpr.orchestration.wait.interval.seconds" = "900"
                            }
                          + JobName   = "pending-files-check-program-profiles-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Copy Archived Data to Raw Bucket"                     = {
                      + Next       = "Start Glue Batch Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                            = "program-profiles"
                              + "--dpr.config.s3.bucket"                      = "dpr-glue-jobs-preproduction"
                              + "--dpr.datastorage.retry.maxAttempts"         = "10"
                              + "--dpr.datastorage.retry.maxWaitMillis"       = "10000"
                              + "--dpr.datastorage.retry.minWaitMillis"       = "1000"
                              + "--dpr.file.transfer.delete.copied.files"     = "false"
                              + "--dpr.file.transfer.destination.bucket"      = "dpr-raw-zone-preproduction"
                              + "--dpr.file.transfer.retention.period.amount" = "0"
                              + "--dpr.file.transfer.source.bucket"           = "dpr-raw-archive-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Copy Curated Data to Temp-Reload Bucket"              = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "program-profiles"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.datastorage.retry.maxAttempts"     = "10"
                              + "--dpr.datastorage.retry.maxWaitMillis"   = "10000"
                              + "--dpr.datastorage.retry.minWaitMillis"   = "1000"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Deactivate Archive Trigger"                           = {
                      + Next       = "Stop Archive Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.glue.trigger.activate" = "false"
                              + "--dpr.glue.trigger.name"     = "dpr-archive-program-profiles-preproduction-trigger"
                            }
                          + JobName   = "dpr-activate-glue-trigger-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Raw Data"                                       = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "program-profiles"
                              + "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Structured and Curated Data"                    = {
                      + Next       = "Archive Remaining Raw Files"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "program-profiles"
                              + "--dpr.file.deletion.buckets" = "dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "program-profiles"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Prepare Temp Reload Bucket Data"                      = {
                      + Next       = "Copy Curated Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "program-profiles"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Reactivate Archive Trigger"                           = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.glue.trigger.activate" = "true"
                              + "--dpr.glue.trigger.name"     = "dpr-archive-program-profiles-preproduction-trigger"
                            }
                          + JobName   = "dpr-activate-glue-trigger-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Resume DMS Replication Task"                          = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:TZZDP7ZEVVCDDEFYLKNEM67FSU"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Run Compaction Job on Curated Zone"                   = {
                      + Next       = "Run Vacuum Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "program-profiles"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Compaction Job on Structured Zone"                = {
                      + Next       = "Run Vacuum Job on Structured Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "program-profiles"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Curated Zone"                       = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "program-profiles"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Structured Zone"                    = {
                      + Next       = "Run Compaction Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "program-profiles"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Run Compaction Job on Structured Zone"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.batch.load.fileglobpattern" = "{part-*.snappy.parquet,LOAD*parquet}"
                              + "--dpr.config.key"                 = "program-profiles"
                              + "--dpr.config.s3.bucket"           = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-batch-program-profiles-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Check All Files Have Been Replayed"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.clean.cdc.checkpoint" = "true"
                              + "--dpr.config.key"           = "program-profiles"
                              + "--dpr.config.s3.bucket"     = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-cdc-program-profiles-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Archive Job"                                     = {
                      + Next       = "Stop DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-archive-program-profiles-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Stop DMS Replication Task"                            = {
                      + Next       = "Check All Pending Files Have Been Processed"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.dms.replication.task.id" = "dpr-dms-nomis-oracle-s3-program-profiles-task-preproduction"
                            }
                          + JobName   = "dpr-stop-dms-task-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Prepare Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-cdc-program-profiles-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Reactivate Archive Trigger"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "program-profiles"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-data-source-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Empty Structured and Curated Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "program-profiles"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-data-source-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-replay-pipeline-nomis-program-profiles-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "program-profiles"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "program-profiles"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration {
          + include_execution_data = true
          + level                  = "ERROR"
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = true
        }
    }

  # module.replay-pipeline["questionnaire"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be created
  + resource "aws_cloudwatch_log_group" "step-function-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-questionnaire-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "questionnaire"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-questionnaire-preproduction"
        }
      + tags_all          = {
          + "Domain"         = "questionnaire"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-questionnaire-preproduction"
        }
    }

  # module.replay-pipeline["questionnaire"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
        id                        = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-questionnaire-preproduction"
        name                      = "dpr-replay-pipeline-nomis-questionnaire-preproduction"
        tags                      = {
            "Domain"         = "questionnaire"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (12 unchanged attributes hidden)

      ~ logging_configuration {
          ~ include_execution_data = false -> true
          ~ level                  = "OFF" -> "ERROR"
          + log_destination        = (known after apply)
        }

      ~ tracing_configuration {
          ~ enabled = false -> true
        }

        # (1 unchanged block hidden)
    }

  # module.replay-pipeline["reference"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be created
  + resource "aws_cloudwatch_log_group" "step-function-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-reference-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "reference"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-reference-preproduction"
        }
      + tags_all          = {
          + "Domain"         = "reference"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-reference-preproduction"
        }
    }

  # module.replay-pipeline["reference"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
        id                        = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-reference-preproduction"
        name                      = "dpr-replay-pipeline-nomis-reference-preproduction"
        tags                      = {
            "Domain"         = "reference"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (12 unchanged attributes hidden)

      ~ logging_configuration {
          ~ include_execution_data = false -> true
          ~ level                  = "OFF" -> "ERROR"
          + log_destination        = (known after apply)
        }

      ~ tracing_configuration {
          ~ enabled = false -> true
        }

        # (1 unchanged block hidden)
    }

  # module.replay-pipeline["safety"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be created
  + resource "aws_cloudwatch_log_group" "step-function-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-safety-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "safety"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-safety-preproduction"
        }
      + tags_all          = {
          + "Domain"         = "safety"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-safety-preproduction"
        }
    }

  # module.replay-pipeline["safety"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
        id                        = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-safety-preproduction"
        name                      = "dpr-replay-pipeline-nomis-safety-preproduction"
        tags                      = {
            "Domain"         = "safety"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (12 unchanged attributes hidden)

      ~ logging_configuration {
          ~ include_execution_data = false -> true
          ~ level                  = "OFF" -> "ERROR"
          + log_destination        = (known after apply)
        }

      ~ tracing_configuration {
          ~ enabled = false -> true
        }

        # (1 unchanged block hidden)
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be created
  + resource "aws_cloudwatch_log_group" "step-function-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-sentence-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "sentence"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-sentence-preproduction"
        }
      + tags_all          = {
          + "Domain"         = "sentence"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-sentence-preproduction"
        }
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
        id                        = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-sentence-preproduction"
        name                      = "dpr-replay-pipeline-nomis-sentence-preproduction"
        tags                      = {
            "Domain"         = "sentence"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (12 unchanged attributes hidden)

      ~ logging_configuration {
          ~ include_execution_data = false -> true
          ~ level                  = "OFF" -> "ERROR"
          + log_destination        = (known after apply)
        }

      ~ tracing_configuration {
          ~ enabled = false -> true
        }

        # (1 unchanged block hidden)
    }

  # module.replay-pipeline["transactions"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be created
  + resource "aws_cloudwatch_log_group" "step-function-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-transactions-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "transactions"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-transactions-preproduction"
        }
      + tags_all          = {
          + "Domain"         = "transactions"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-transactions-preproduction"
        }
    }

  # module.replay-pipeline["transactions"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
        id                        = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-transactions-preproduction"
        name                      = "dpr-replay-pipeline-nomis-transactions-preproduction"
        tags                      = {
            "Domain"         = "transactions"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (12 unchanged attributes hidden)

      ~ logging_configuration {
          ~ include_execution_data = false -> true
          ~ level                  = "OFF" -> "ERROR"
          + log_destination        = (known after apply)
        }

      ~ tracing_configuration {
          ~ enabled = false -> true
        }

        # (1 unchanged block hidden)
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be created
  + resource "aws_cloudwatch_log_group" "step-function-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-visits-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-visits-preproduction"
        }
      + tags_all          = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-visits-preproduction"
        }
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
        id                        = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-visits-preproduction"
        name                      = "dpr-replay-pipeline-nomis-visits-preproduction"
        tags                      = {
            "Domain"         = "visits"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (12 unchanged attributes hidden)

      ~ logging_configuration {
          ~ include_execution_data = false -> true
          ~ level                  = "OFF" -> "ERROR"
          + log_destination        = (known after apply)
        }

      ~ tracing_configuration {
          ~ enabled = false -> true
        }

        # (1 unchanged block hidden)
    }

Plan: 383 to add, 411 to change, 2 to destroy.

```